Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer
The Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer class defines the equality comparer for Tekla.Structures.Model.Object instances
for which only the Tekla.Structures.Model.Object.Identifier property determines the equality.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.Instance
The singleton instance.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.#ctor
Prevents a default instance of the Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer class from being created.
Uses the singleton instance ObjectIdentifierEqualityComparer.Instance instead.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.Equals(Tekla.Structures.Model.Object,Tekla.Structures.Model.Object)
Determines whether the specified objects are equal by their Tekla.Structures.Identifier.
x: The first object of type Tekla.Structures.Model.Object to compare by its Tekla.Structures.Model.Object.Identifier property.
y: The other object of type Tekla.Structures.Model.Object to compare by its Tekla.Structures.Model.Object.Identifier property.
Returns: True if the specified objects are equal by Tekla.Structures.Identifier; otherwise, false.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.System#Collections#IEqualityComparer#Equals(System.Object,System.Object)
Determines whether the specified objects are equal.
x: The first object to compare.
y: The second object to compare.
Returns:
true if the specified objects are equal; otherwise, false.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.GetHashCode(System.Object)
Returns a hash code for the specified object.
obj: The System.Object for which a hash code is to be returned.
Returns: A hash code for the specified object.

Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer.GetHashCode(Tekla.Structures.Model.Object)
Returns a hash code for the Tekla.Structures.Model.Object.Identifier of the specified Tekla.Structures.Model.Object.
obj: The Tekla.Structures.Model.Object for which a hash code is to be returned.
Returns: A hash code for the Tekla.Structures.Model.Object.Identifier of the specified Tekla.Structures.Model.Object.